Revit 2027 API
UIDocument.ShowElements(Element) Method
Shows the element by zoom to fit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowElements(
	Element element
)
Public Sub ShowElements (
	element As Element
)
public:
void ShowElements(
	Element^ element
)
member ShowElements :
        element : Element -> unit
Parameters
element Element
Element that will be shown.
Exceptions
Exception | Condition
ArgumentNullException | Element is null.
Remarks
Places the element in the center of screen by moving the view.
See Also
Reference
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace